experiment-data/MicroShift/dp_redis_density-2/dp_redis_density/2022-10-11T11-08-25/kbench-pod-oid-0-tid-1/memtier.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1648.66          ---          ---        11.04926         5.98300        86.52700       181.24700       127.01 
Gets        16484.92         3.42     16481.50        11.00513         5.95100        86.01500       181.24700       642.25 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      18133.59         3.42     16481.50        11.00914         5.95100        86.01500       181.24700       769.25 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.199        0.000
SET       1.215        5.000
SET       1.559       10.000
SET       1.959       15.000
SET       2.575       20.000
SET       3.119       25.000
SET       3.647       30.000
SET       4.191       35.000
SET       4.767       40.000
SET       5.311       45.000
SET       5.983       50.000
SET       6.303       52.500
SET       6.687       55.000
SET       7.103       57.500
SET       7.519       60.000
SET       8.031       62.500
SET       8.639       65.000
SET       9.343       67.500
SET      10.111       70.000
SET      11.071       72.500
SET      12.159       75.000
SET      12.799       76.250
SET      13.439       77.500
SET      14.143       78.750
SET      14.911       80.000
SET      15.679       81.250
SET      16.639       82.500
SET      17.535       83.750
SET      18.559       85.000
SET      19.711       86.250
SET      20.991       87.500
SET      21.759       88.125
SET      22.527       88.750
SET      23.295       89.375
SET      24.191       90.000
SET      25.215       90.625
SET      26.367       91.250
SET      27.647       91.875
SET      29.055       92.500
SET      30.591       93.125
SET      32.127       93.750
SET      33.023       94.062
SET      34.047       94.375
SET      35.327       94.688
SET      36.351       95.000
SET      37.631       95.312
SET      39.167       95.625
SET      40.959       95.938
SET      42.751       96.250
SET      44.799       96.562
SET      47.103       96.875
SET      48.639       97.031
SET      49.919       97.188
SET      51.711       97.344
SET      53.759       97.500
SET      55.807       97.656
SET      58.111       97.812
SET      60.415       97.969
SET      63.487       98.125
SET      66.559       98.281
SET      69.631       98.438
SET      71.679       98.516
SET      73.727       98.594
SET      75.263       98.672
SET      77.823       98.750
SET      80.383       98.828
SET      82.943       98.906
SET      86.015       98.984
SET      89.087       99.062
SET      92.159       99.141
SET      95.231       99.219
SET      97.279       99.258
SET      99.839       99.297
SET     102.399       99.336
SET     104.447       99.375
SET     107.007       99.414
SET     109.567       99.453
SET     112.639       99.492
SET     115.711       99.531
SET     119.295       99.570
SET     122.879       99.609
SET     124.927       99.629
SET     126.975       99.648
SET     129.023       99.668
SET     132.095       99.688
SET     135.167       99.707
SET     137.215       99.727
SET     139.263       99.746
SET     142.335       99.766
SET     146.431       99.785
SET     150.527       99.805
SET     152.575       99.814
SET     155.647       99.824
SET     157.695       99.834
SET     160.767       99.844
SET     162.815       99.854
SET     165.887       99.863
SET     168.959       99.873
SET     172.031       99.883
SET     177.151       99.893
SET     182.271       99.902
SET     184.319       99.907
SET     186.367       99.912
SET     189.439       99.917
SET     192.511       99.922
SET     195.583       99.927
SET     199.679       99.932
SET     202.751       99.937
SET     204.799       99.941
SET     208.895       99.946
SET     215.039       99.951
SET     219.135       99.954
SET     222.207       99.956
SET     226.303       99.958
SET     229.375       99.961
SET     231.423       99.963
SET     235.519       99.966
SET     240.639       99.968
SET     246.783       99.971
SET     251.903       99.973
SET     255.999       99.976
SET     260.095       99.977
SET     266.239       99.978
SET     274.431       99.979
SET     282.623       99.980
SET     284.671       99.982
SET     288.767       99.983
SET     290.815       99.984
SET     292.863       99.985
SET     294.911       99.987
SET     296.959       99.988
SET     299.007       99.988
SET     303.103       99.989
SET     305.151       99.990
SET     309.247       99.990
SET     311.295       99.991
SET     315.391       99.991
SET     319.487       99.992
SET     333.823       99.993
SET     344.063       99.993
SET     352.255       99.994
SET     360.447       99.994
SET     370.687       99.995
SET     385.023       99.995
SET     399.359       99.995
SET     403.455       99.995
SET     413.695       99.996
SET     417.791       99.996
SET     419.839       99.996
SET     421.887       99.997
SET     421.887       99.997
SET     421.887       99.997
[...]
SET     423.935       99.997
SET     423.935       99.998
SET     436.223       99.998
SET     438.271       99.998
SET     442.367       99.998
SET     448.511       99.998
SET     448.511       99.998
SET     450.559       99.998
SET     452.607       99.999
SET     454.655       99.999
SET     454.655       99.999
SET     454.655       99.999
SET     456.703       99.999
SET     456.703       99.999
SET     456.703       99.999
[...]
SET     458.751       99.999
SET     466.943       99.999
SET     466.943       99.999
SET     466.943       99.999
[...]
SET     468.991       99.999
SET     468.991       99.999
SET     473.087      100.000
SET     473.087      100.000
SET     473.087      100.000
[...]
SET     487.423      100.000
SET     487.423      100.000
SET     487.423      100.000
[...]
SET     514.047      100.000
SET     514.047      100.000
---
GET       0.167        0.000
GET       1.215        5.000
GET       1.559       10.000
GET       1.959       15.000
GET       2.575       20.000
GET       3.119       25.000
GET       3.647       30.000
GET       4.191       35.000
GET       4.735       40.000
GET       5.311       45.000
GET       5.951       50.000
GET       6.303       52.500
GET       6.655       55.000
GET       7.071       57.500
GET       7.519       60.000
GET       8.031       62.500
GET       8.639       65.000
GET       9.343       67.500
GET      10.111       70.000
GET      11.007       72.500
GET      12.095       75.000
GET      12.735       76.250
GET      13.375       77.500
GET      14.079       78.750
GET      14.847       80.000
GET      15.679       81.250
GET      16.511       82.500
GET      17.407       83.750
GET      18.431       85.000
GET      19.583       86.250
GET      20.991       87.500
GET      21.631       88.125
GET      22.399       88.750
GET      23.167       89.375
GET      24.191       90.000
GET      25.215       90.625
GET      26.239       91.250
GET      27.519       91.875
GET      28.927       92.500
GET      30.463       93.125
GET      31.999       93.750
GET      33.023       94.062
GET      34.047       94.375
GET      35.071       94.688
GET      36.351       95.000
GET      37.631       95.312
GET      38.911       95.625
GET      40.703       95.938
GET      42.495       96.250
GET      44.543       96.562
GET      46.847       96.875
GET      48.127       97.031
GET      49.663       97.188
GET      51.199       97.344
GET      53.247       97.500
GET      55.295       97.656
GET      57.343       97.812
GET      59.903       97.969
GET      62.719       98.125
GET      66.047       98.281
GET      69.119       98.438
GET      71.167       98.516
GET      72.703       98.594
GET      74.751       98.672
GET      76.799       98.750
GET      79.359       98.828
GET      82.431       98.906
GET      85.503       98.984
GET      88.063       99.062
GET      91.135       99.141
GET      94.719       99.219
GET      96.767       99.258
GET      98.815       99.297
GET     101.375       99.336
GET     103.935       99.375
GET     106.495       99.414
GET     109.055       99.453
GET     112.127       99.492
GET     115.711       99.531
GET     118.783       99.570
GET     122.367       99.609
GET     124.415       99.629
GET     126.463       99.648
GET     128.511       99.668
GET     130.559       99.688
GET     134.143       99.707
GET     136.191       99.727
GET     139.263       99.746
GET     143.359       99.766
GET     146.431       99.785
GET     150.527       99.805
GET     152.575       99.814
GET     155.647       99.824
GET     157.695       99.834
GET     160.767       99.844
GET     163.839       99.854
GET     165.887       99.863
GET     169.983       99.873
GET     173.055       99.883
GET     177.151       99.893
GET     182.271       99.902
GET     184.319       99.907
GET     187.391       99.912
GET     190.463       99.917
GET     192.511       99.922
GET     195.583       99.927
GET     198.655       99.932
GET     202.751       99.937
GET     204.799       99.941
GET     207.871       99.946
GET     212.991       99.951
GET     215.039       99.954
GET     218.111       99.956
GET     220.159       99.958
GET     224.255       99.961
GET     229.375       99.963
GET     233.471       99.966
GET     238.591       99.968
GET     244.735       99.971
GET     247.807       99.973
GET     252.927       99.976
GET     255.999       99.977
GET     260.095       99.978
GET     264.191       99.979
GET     270.335       99.980
GET     276.479       99.982
GET     282.623       99.983
GET     284.671       99.984
GET     286.719       99.985
GET     290.815       99.987
GET     290.815       99.988
GET     292.863       99.988
GET     292.863       99.989
GET     296.959       99.990
GET     296.959       99.990
GET     299.007       99.991
GET     303.103       99.991
GET     305.151       99.992
GET     307.199       99.993
GET     313.343       99.993
GET     319.487       99.994
GET     321.535       99.994
GET     331.775       99.995
GET     335.871       99.995
GET     339.967       99.995
GET     346.111       99.995
GET     350.207       99.996
GET     354.303       99.996
GET     362.495       99.996
GET     387.071       99.997
GET     403.455       99.997
GET     405.503       99.997
GET     415.743       99.997
GET     415.743       99.997
GET     417.791       99.998
GET     419.839       99.998
GET     419.839       99.998
GET     419.839       99.998
GET     421.887       99.998
GET     421.887       99.998
GET     423.935       99.998
GET     423.935       99.999
GET     425.983       99.999
GET     425.983       99.999
GET     428.031       99.999
GET     436.223       99.999
GET     438.271       99.999
GET     440.319       99.999
GET     448.511       99.999
GET     448.511       99.999
GET     450.559       99.999
GET     450.559       99.999
GET     452.607       99.999
GET     452.607       99.999
GET     454.655       99.999
GET     456.703       99.999
GET     456.703       99.999
GET     456.703      100.000
GET     466.943      100.000
GET     466.943      100.000
GET     468.991      100.000
GET     468.991      100.000
GET     468.991      100.000
[...]
GET     471.039      100.000
GET     471.039      100.000
GET     473.087      100.000
GET     473.087      100.000
GET     473.087      100.000
[...]
GET     475.135      100.000
GET     475.135      100.000
GET     475.135      100.000
[...]
GET     483.327      100.000
GET     483.327      100.000
GET     485.375      100.000
GET     485.375      100.000
GET     487.423      100.000
GET     487.423      100.000
GET     487.423      100.000
[...]
GET     514.047      100.000
GET     514.047      100.000
GET     514.047      100.000
[...]
GET     518.143      100.000
GET     518.143      100.000
---
WAIT      0.000      100.000